data/raw_bench/1600_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.547ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.551ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.550ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.553ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   539.41us  100.11us 823.00us   72.67%
    Req/Sec   419.11    209.61     1.00k    67.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  525.00us
 75.000%  597.00us
 90.000%  665.00us
 99.000%  823.00us
 99.900%    1.13ms
 99.990%    1.58ms
 99.999%    1.75ms
100.000%    1.75ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.286     0.000000            2         1.00
       0.428     0.100000         3180         1.11
       0.457     0.200000         6460         1.25
       0.480     0.300000         9587         1.43
       0.502     0.400000        12792         1.67
       0.525     0.500000        15917         2.00
       0.538     0.550000        17595         2.22
       0.550     0.600000        19057         2.50
       0.564     0.650000        20694         2.86
       0.579     0.700000        22239         3.33
       0.597     0.750000        23904         4.00
       0.606     0.775000        24667         4.44
       0.615     0.800000        25453         5.00
       0.626     0.825000        26266         5.71
       0.637     0.850000        27048         6.67
       0.650     0.875000        27842         8.00
       0.657     0.887500        28194         8.89
       0.665     0.900000        28590        10.00
       0.675     0.912500        29000        11.43
       0.685     0.925000        29385        13.33
       0.697     0.937500        29792        16.00
       0.704     0.943750        29993        17.78
       0.712     0.950000        30181        20.00
       0.720     0.956250        30371        22.86
       0.731     0.962500        30578        26.67
       0.744     0.968750        30786        32.00
       0.751     0.971875        30868        35.56
       0.758     0.975000        30966        40.00
       0.768     0.978125        31073        45.71
       0.778     0.981250        31167        53.33
       0.792     0.984375        31275        64.00
       0.798     0.985938        31319        71.11
       0.807     0.987500        31365        80.00
       0.818     0.989062        31412        91.43
       0.831     0.990625        31467       106.67
       0.844     0.992188        31511       128.00
       0.855     0.992969        31537       142.22
       0.870     0.993750        31561       160.00
       0.884     0.994531        31586       182.86
       0.912     0.995313        31611       213.33
       0.943     0.996094        31635       256.00
       0.968     0.996484        31649       284.44
       0.991     0.996875        31661       320.00
       1.017     0.997266        31673       365.71
       1.037     0.997656        31686       426.67
       1.070     0.998047        31697       512.00
       1.086     0.998242        31704       568.89
       1.094     0.998437        31710       640.00
       1.100     0.998633        31716       731.43
       1.117     0.998828        31722       853.33
       1.145     0.999023        31728      1024.00
       1.179     0.999121        31732      1137.78
       1.190     0.999219        31735      1280.00
       1.198     0.999316        31738      1462.86
       1.215     0.999414        31741      1706.67
       1.252     0.999512        31744      2048.00
       1.267     0.999561        31746      2275.56
       1.270     0.999609        31747      2560.00
       1.312     0.999658        31749      2925.71
       1.315     0.999707        31750      3413.33
       1.355     0.999756        31752      4096.00
       1.360     0.999780        31753      4551.11
       1.360     0.999805        31753      5120.00
       1.424     0.999829        31754      5851.43
       1.459     0.999854        31755      6826.67
       1.576     0.999878        31756      8192.00
       1.576     0.999890        31756      9102.22
       1.576     0.999902        31756     10240.00
       1.597     0.999915        31757     11702.86
       1.597     0.999927        31757     13653.33
       1.683     0.999939        31758     16384.00
       1.683     0.999945        31758     18204.44
       1.683     0.999951        31758     20480.00
       1.683     0.999957        31758     23405.71
       1.683     0.999963        31758     27306.67
       1.746     0.999969        31759     32768.00
       1.746     1.000000        31759          inf
#[Mean    =        0.539, StdDeviation   =        0.100]
#[Max     =        1.746, Total count    =        31759]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  47688 requests in 30.00s, 9.05MB read
  Socket errors: connect 0, read 0, write 0, timeout 2
Requests/sec:   1589.61  
Transfer/sec:    308.92KB