data/raw_bench/2100_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.530ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.528ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.518ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.528ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   517.97us   98.66us 818.00us   75.06%
    Req/Sec   554.75    241.39     1.20k    66.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  502.00us
 75.000%  568.00us
 90.000%  639.00us
 99.000%  818.00us
 99.900%    1.15ms
 99.990%    1.80ms
 99.999%    2.27ms
100.000%    2.27ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.299     0.000000            1         1.00
       0.413     0.100000         4258         1.11
       0.441     0.200000         8534         1.25
       0.461     0.300000        12626         1.43
       0.481     0.400000        16895         1.67
       0.502     0.500000        21210         2.00
       0.513     0.550000        23259         2.22
       0.525     0.600000        25373         2.50
       0.537     0.650000        27316         2.86
       0.552     0.700000        29551         3.33
       0.568     0.750000        31618         4.00
       0.577     0.775000        32645         4.44
       0.586     0.800000        33652         5.00
       0.596     0.825000        34665         5.71
       0.608     0.850000        35746         6.67
       0.622     0.875000        36781         8.00
       0.630     0.887500        37319         8.89
       0.639     0.900000        37826        10.00
       0.649     0.912500        38351        11.43
       0.660     0.925000        38889        13.33
       0.673     0.937500        39430        16.00
       0.680     0.943750        39674        17.78
       0.689     0.950000        39946        20.00
       0.699     0.956250        40200        22.86
       0.711     0.962500        40464        26.67
       0.722     0.968750        40705        32.00
       0.731     0.971875        40838        35.56
       0.740     0.975000        40967        40.00
       0.751     0.978125        41100        45.71
       0.763     0.981250        41226        53.33
       0.779     0.984375        41361        64.00
       0.787     0.985938        41430        71.11
       0.797     0.987500        41493        80.00
       0.810     0.989062        41554        91.43
       0.825     0.990625        41620       106.67
       0.848     0.992188        41685       128.00
       0.867     0.992969        41719       142.22
       0.880     0.993750        41751       160.00
       0.900     0.994531        41784       182.86
       0.922     0.995313        41818       213.33
       0.957     0.996094        41849       256.00
       0.975     0.996484        41866       284.44
       1.000     0.996875        41882       320.00
       1.027     0.997266        41899       365.71
       1.055     0.997656        41915       426.67
       1.079     0.998047        41931       512.00
       1.102     0.998242        41940       568.89
       1.111     0.998437        41949       640.00
       1.133     0.998633        41957       731.43
       1.141     0.998828        41965       853.33
       1.157     0.999023        41972      1024.00
       1.171     0.999121        41978      1137.78
       1.183     0.999219        41981      1280.00
       1.187     0.999316        41985      1462.86
       1.198     0.999414        41989      1706.67
       1.221     0.999512        41993      2048.00
       1.230     0.999561        41995      2275.56
       1.244     0.999609        41997      2560.00
       1.266     0.999658        41999      2925.71
       1.269     0.999707        42001      3413.33
       1.349     0.999756        42003      4096.00
       1.359     0.999780        42004      4551.11
       1.406     0.999805        42005      5120.00
       1.468     0.999829        42006      5851.43
       1.503     0.999854        42007      6826.67
       1.656     0.999878        42008      8192.00
       1.800     0.999890        42009      9102.22
       1.800     0.999902        42009     10240.00
       1.850     0.999915        42010     11702.86
       1.850     0.999927        42010     13653.33
       1.874     0.999939        42011     16384.00
       1.874     0.999945        42011     18204.44
       1.874     0.999951        42011     20480.00
       2.145     0.999957        42012     23405.71
       2.145     0.999963        42012     27306.67
       2.145     0.999969        42012     32768.00
       2.145     0.999973        42012     36408.89
       2.145     0.999976        42012     40960.00
       2.267     0.999979        42013     46811.43
       2.267     1.000000        42013          inf
#[Mean    =        0.518, StdDeviation   =        0.099]
#[Max     =        2.266, Total count    =        42013]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  62302 requests in 30.00s, 11.82MB read
Requests/sec:   2076.60  
Transfer/sec:    403.56KB